ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cgms.c
/******************************************************************************
* Function Name: Cy_BLE_CGMSS_ConfirmationEventHandler
***************************************************************************//**
*
*  Handles a Value Confirmation request event from the BLE stack.
*
*  \param eventParam: The pointer to a structure of type cy_stc_ble_conn_handle_t
*
******************************************************************************/
static void Cy_BLE_CGMSS_ConfirmationEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    if((Cy_BLE_CGMS_ApplCallback != NULL)
       && (cy_ble_cgmsConfigPtr->cgmss->charInfo[CY_BLE_CGMS_RACP].charHandle == cy_ble_cgmssReqHandle))
    {
        cy_stc_ble_cgms_char_value_t locCharIndex;

        for(locCharIndex.charIndex = CY_BLE_CGMS_RACP;
            locCharIndex.charIndex < CY_BLE_CGMS_CHAR_COUNT; locCharIndex.charIndex++)
        {
            if(cy_ble_cgmsConfigPtr->cgmss->charInfo[locCharIndex.charIndex].charHandle == cy_ble_cgmssReqHandle)
            {
                cy_ble_cgmssReqHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                locCharIndex.connHandle = *eventParam;
                locCharIndex.value = NULL;

                if(locCharIndex.charIndex == CY_BLE_CGMS_RACP)
                {
                    cy_ble_cgmsFlag &= (uint8_t) ~CY_BLE_CGMS_FLAG_PROCESS;
                }

                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                Cy_BLE_CGMS_ApplCallback((uint32_t)CY_BLE_EVT_CGMSS_INDICATION_CONFIRMED, &locCharIndex);
            }
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_CGMSS_WriteEventHandler
***************************************************************************//**
*
*  Handles a Write Request event. Calls the registered CGMS application
*  callback function.
*
* Note: Writing the attribute into GATT DB (if needed) is on the user's responsibility,
*  after the characteristic content check in the registered CGMS application
*  callback function.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
* \return
*  cy_en_ble_gatt_err_code_t - A function result state if it succeeded
*  (CY_BLE_GATT_ERR_NONE) or failed with error codes:
*   * CY_BLE_GATTS_ERR_PROCEDURE_ALREADY_IN_PROGRESS
*   * CY_BLE_GATTS_ERR_CCCD_IMPROPERLY_CONFIGURED
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_CGMSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_stc_ble_cgms_char_value_t locCharValue =
    {
        .gattErrorCode = CY_BLE_GATT_ERR_NONE,
        .connHandle    = eventParam->connHandle
    };

    if(Cy_BLE_CGMS_ApplCallback != NULL)
    {
        for(locCharValue.charIndex = CY_BLE_CGMS_CGMT;
            locCharValue.charIndex < CY_BLE_CGMS_CHAR_COUNT; locCharValue.charIndex++)
        {
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair = eventParam->handleValPair,
                .connHandle      = eventParam->connHandle,
                .offset          = 0u,
                .flags           = CY_BLE_GATT_DB_PEER_INITIATED
            };
            if(eventParam->handleValPair.attrHandle ==
               cy_ble_cgmsConfigPtr->cgmss->charInfo[locCharValue.charIndex].charHandle)
            {
                locCharValue.value = &eventParam->handleValPair.value;

                if(locCharValue.charIndex == CY_BLE_CGMS_RACP)
                {
                    if(CY_BLE_CGMS_IS_PROCEDURE_IN_PROGRESS)
                    {
                        if(eventParam->handleValPair.value.val[0u] == CY_BLE_CGMS_RACP_OPCODE_ABORT)
                        {
                            cy_ble_cgmsFlag &= (uint8_t) ~CY_BLE_CGMS_FLAG_PROCESS;
                        }
                        else
                        {
                            locCharValue.gattErrorCode = CY_BLE_GATT_ERR_PROCEDURE_ALREADY_IN_PROGRESS;
                        }
                    }
                    else if(!CY_BLE_IS_INDICATION_ENABLED(eventParam->connHandle.attId,
                                                          cy_ble_cgmsConfigPtr->cgmss->
                                                           charInfo[CY_BLE_CGMS_RACP].descrHandle[CY_BLE_CGMS_CCCD]))
                    {
                        locCharValue.gattErrorCode = CY_BLE_GATT_ERR_CCCD_IMPROPERLY_CONFIGURED;
                    }
                    else
                    {
                        cy_ble_cgmsFlag |= CY_BLE_CGMS_FLAG_PROCESS;
                    }
                }
                else
                {
                    /* CY_BLE_CGMS_SOCP or CY_BLE_CGMS_SSTM */
                }

                if(locCharValue.gattErrorCode == CY_BLE_GATT_ERR_NONE)
                {
                    Cy_BLE_CGMS_ApplCallback((uint32_t)CY_BLE_EVT_CGMSS_WRITE_CHAR, &locCharValue);
                }

                if(locCharValue.gattErrorCode == CY_BLE_GATT_ERR_NONE)
                {
                    locCharValue.gattErrorCode = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);
                }

                /* Clear callback flag indicating that request was handled */
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                locCharValue.charIndex = CY_BLE_CGMS_CHAR_COUNT; /* instead of break */
            }
            else if(eventParam->handleValPair.attrHandle ==
                    cy_ble_cgmsConfigPtr->cgmss->charInfo[locCharValue.charIndex].descrHandle[CY_BLE_CGMS_CCCD])
            {
                locCharValue.value = NULL;
                locCharValue.gattErrorCode = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);
                if(locCharValue.gattErrorCode == CY_BLE_GATT_ERR_NONE)
                {
                    uint32_t eventCode;

                    if(locCharValue.charIndex == CY_BLE_CGMS_CGMT)
                    {
                        if(CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                        {
                            eventCode = (uint32_t)CY_BLE_EVT_CGMSS_NOTIFICATION_ENABLED;
                        }
                        else
                        {
                            eventCode = (uint32_t)CY_BLE_EVT_CGMSS_NOTIFICATION_DISABLED;
                        }
                    }
                    else
                    {
                        if(CY_BLE_IS_INDICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                        {
                            eventCode = (uint32_t)CY_BLE_EVT_CGMSS_INDICATION_ENABLED;
                        }
                        else
                        {
                            eventCode = (uint32_t)CY_BLE_EVT_CGMSS_INDICATION_DISABLED;
                        }
                    }

